smartpanle/QMSD-ESP32-BSP/components/qmsd_screen/rgb_panel/qmsd_lcd_panel_rgb.c
    // we need to refill the bounce buffer in the DMA EOF interrupt, so only register the callback for bounce buffer mode
    if (panel->bb_size) {
        gdma_tx_event_callbacks_t cbs = {
            .on_trans_eof = lcd_rgb_panel_eof_handler,
        };
        gdma_register_tx_event_callbacks(panel->dma_chan, &cbs, panel);
    }

    return ESP_OK;
}

#if CONFIG_LCD_RGB_RESTART_IN_VSYNC
static IRAM_ATTR void lcd_rgb_panel_restart_transmission_in_isr(esp_rgb_panel_t *panel)
{
    if (panel->bb_size) {
        // Catch de-synced frame buffer and reset if needed.
        if (panel->bounce_pos_px > panel->bb_size) {
            panel->bounce_pos_px = 0;
        }
        // Pre-fill bounce buffer 0, if the EOF ISR didn't do that already
        if (panel->bounce_pos_px < panel->bb_size / 2) {
            lcd_rgb_panel_fill_bounce_buffer(panel, panel->bounce_buffer[0]);
        }
    }

    gdma_reset(panel->dma_chan);
    // restart the DMA by a special DMA node
    gdma_start(panel->dma_chan, (intptr_t)&panel->dma_restart_node);

    if (panel->bb_size) {
        // Fill 2nd bounce buffer while 1st is being sent out, if needed.
        if (panel->bounce_pos_px < panel->bb_size) {
            lcd_rgb_panel_fill_bounce_buffer(panel, panel->bounce_buffer[0]);
        }
    }
}
#endif

static void lcd_rgb_panel_start_transmission(esp_rgb_panel_t *rgb_panel)
{
    // reset FIFO of DMA and LCD, incase there remains old frame data
    gdma_reset(rgb_panel->dma_chan);
    lcd_ll_stop(rgb_panel->hal.dev);
    lcd_ll_fifo_reset(rgb_panel->hal.dev);

    // pre-fill bounce buffers if needed
    if (rgb_panel->bb_size) {
        rgb_panel->bounce_pos_px = 0;
        lcd_rgb_panel_fill_bounce_buffer(rgb_panel, rgb_panel->bounce_buffer[0]);
        lcd_rgb_panel_fill_bounce_buffer(rgb_panel, rgb_panel->bounce_buffer[1]);
    }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 2)
    if (rgb_panel->bb_size) {
        gdma_start(rgb_panel->dma_chan, gdma_link_get_head_addr(rgb_panel->dma_bb_link));
    }  else {
        gdma_start(rgb_panel->dma_chan, gdma_link_get_head_addr(rgb_panel->dma_fb_links[rgb_panel->cur_fb_index]));
    }
#else
    // the start of DMA should be prior to the start of LCD engine
    gdma_start(rgb_panel->dma_chan, (intptr_t)rgb_panel->dma_links[rgb_panel->cur_fb_index]);
#endif
    // delay 1us is sufficient for DMA to pass data to LCD FIFO
    // in fact, this is only needed when LCD pixel clock is set too high
    esp_rom_delay_us(1);
    // start LCD engine
    lcd_ll_start(rgb_panel->hal.dev);
}

IRAM_ATTR static void lcd_rgb_panel_try_update_pclk(esp_rgb_panel_t *rgb_panel)
{
    portENTER_CRITICAL_ISR(&rgb_panel->spinlock);
    if (unlikely(rgb_panel->flags.need_update_pclk)) {
        rgb_panel->flags.need_update_pclk = false;
        rgb_panel->timings.pclk_hz = qmsd_lcd_hal_cal_pclk_freq(&rgb_panel->hal, rgb_panel->src_clk_hz, rgb_panel->timings.pclk_hz, 0);
    }
    portEXIT_CRITICAL_ISR(&rgb_panel->spinlock);
}

IRAM_ATTR static void lcd_default_isr_handler(void *args)
{
    esp_rgb_panel_t *rgb_panel = (esp_rgb_panel_t *)args;
    bool need_yield = false;

    uint32_t intr_status = lcd_ll_get_interrupt_status(rgb_panel->hal.dev);
    lcd_ll_clear_interrupt_status(rgb_panel->hal.dev, intr_status);
    if (intr_status & LCD_LL_EVENT_VSYNC_END) {
        // call user registered callback
        if (rgb_panel->on_vsync) {
            if (rgb_panel->on_vsync(&rgb_panel->base, NULL, rgb_panel->user_ctx)) {
                need_yield = true;
            }
        }

        if (rgb_panel->flags.avoid_te) {
            BaseType_t high_task_awoken = pdFALSE;
            xSemaphoreGiveFromISR(rgb_panel->flush_ready, &high_task_awoken);
            need_yield |= high_task_awoken;
        }

        // check whether to update the PCLK frequency, it should be safe to update the PCLK frequency in the VSYNC interrupt
        lcd_rgb_panel_try_update_pclk(rgb_panel);

        if (rgb_panel->flags.stream_mode) {
#if CONFIG_LCD_RGB_RESTART_IN_VSYNC
            // reset the GDMA channel every VBlank to stop permanent desyncs from happening.
            // Note that this fix can lead to single-frame desyncs itself, as in: if this interrupt
            // is late enough, the display will shift as the LCD controller already read out the
            // first data bytes, and resetting DMA will re-send those. However, the single-frame
            // desync this leads to is preferable to the permanent desync that could otherwise
            // happen. It's also not super-likely as this interrupt has the entirety of the VBlank
            // time to reset DMA.
            lcd_rgb_panel_restart_transmission_in_isr(rgb_panel);
#endif
        }

    }

    if (need_yield) {
        portYIELD_FROM_ISR();
    }
}

#if ESP_IDF_VERSION_MAJOR == 5
static esp_err_t lcd_rgb_panel_select_clock_src(esp_rgb_panel_t *panel, user_rgb_clock_source_t clk_src)
{
    esp_err_t ret = ESP_OK;
    switch (clk_src) {
    case USER_RGB_CLK_SRC_PLL240M:
        panel->src_clk_hz = 240000000;
        panel->hal.dev->lcd_clock.lcd_clk_sel = 2;
        break;
    case USER_RGB_CLK_SRC_PLL160M:
        panel->src_clk_hz = 160000000;
        panel->hal.dev->lcd_clock.lcd_clk_sel = 3;
        break;
    case USER_RGB_CLK_SRC_XTAL:
        panel->src_clk_hz = esp_clk_xtal_freq();
        panel->hal.dev->lcd_clock.lcd_clk_sel = 1;
        break;
    default:
        ESP_RETURN_ON_FALSE(false, ESP_ERR_NOT_SUPPORTED, TAG, "unsupported clock source: %d", clk_src);
        break;
    }

    if (clk_src == USER_RGB_CLK_SRC_PLL160M || clk_src == USER_RGB_CLK_SRC_PLL240M) {
#if CONFIG_PM_ENABLE
        ret = esp_pm_lock_create(ESP_PM_APB_FREQ_MAX, 0, "rgb_panel", &panel->pm_lock);
        ESP_RETURN_ON_ERROR(ret, TAG, "create ESP_PM_APB_FREQ_MAX lock failed");
        // hold the lock during the whole lifecycle of RGB panel
        esp_pm_lock_acquire(panel->pm_lock);
        ESP_LOGD(TAG, "installed ESP_PM_APB_FREQ_MAX lock and hold the lock during the whole panel lifecycle");
#endif
    }
    return ret;
}

static uint32_t qmsd_lcd_hal_cal_pclk_freq(lcd_hal_context_t *hal, uint32_t src_freq_hz, uint32_t expect_pclk_freq_hz, int lcd_clk_flags)
{
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
    hal_utils_clk_div_t lcd_clk_div = {};
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 1)
    uint32_t pclk_hz = lcd_hal_cal_pclk_freq(hal, src_freq_hz, expect_pclk_freq_hz, &lcd_clk_div);
#else
    uint32_t pclk_hz = lcd_hal_cal_pclk_freq(hal, src_freq_hz, expect_pclk_freq_hz, 0, &lcd_clk_div);
#endif
    LCD_CLOCK_SRC_ATOMIC() {
        lcd_ll_set_group_clock_coeff(hal->dev, lcd_clk_div.integer, lcd_clk_div.denominator, lcd_clk_div.numerator);
    }
#else
    uint32_t pclk_hz = lcd_hal_cal_pclk_freq(hal, src_freq_hz, expect_pclk_freq_hz, lcd_clk_flags);
#endif
    return pclk_hz;
}

#else
static uint32_t qmsd_lcd_hal_cal_pclk_freq(lcd_hal_context_t *hal, uint32_t src_freq_hz, uint32_t expect_pclk_freq_hz, int lcd_clk_flags)
{
    uint32_t pclk_prescale = src_freq_hz / expect_pclk_freq_hz;
    lcd_ll_set_pixel_clock_prescale(hal->dev, pclk_prescale);
    return src_freq_hz / pclk_prescale;
}

static inline void user_rgb_ll_set_group_clock_src(lcd_cam_dev_t *dev, user_rgb_clock_source_t src, int div_num, int div_a, int div_b) {
    // lcd_clk = module_clock_src / (div_num + div_b / div_a)
    HAL_ASSERT(div_num >= 2);
    HAL_FORCE_MODIFY_U32_REG_FIELD(dev->lcd_clock, lcd_clkm_div_num, div_num);
    dev->lcd_clock.lcd_clkm_div_a = div_a;
    dev->lcd_clock.lcd_clkm_div_b = div_b;
    switch (src) {
        case USER_RGB_CLK_SRC_PLL160M:
            dev->lcd_clock.lcd_clk_sel = 3;
            break;
        case USER_RGB_CLK_SRC_PLL240M:
            dev->lcd_clock.lcd_clk_sel = 2;
            break;
        case USER_RGB_CLK_SRC_XTAL:
            dev->lcd_clock.lcd_clk_sel = 1;
            break;
        default:
            HAL_ASSERT(false && "unsupported clock source");
            break;
    }
}

static esp_err_t lcd_rgb_panel_select_clock_src(esp_rgb_panel_t *panel, user_rgb_clock_source_t clk_src)
{
    esp_err_t ret = ESP_OK;
    user_rgb_ll_set_group_clock_src(panel->hal.dev, clk_src, LCD_PERIPH_CLOCK_PRE_SCALE, 1, 0);
    switch (clk_src) {
        case USER_RGB_CLK_SRC_PLL160M:
            panel->src_clk_hz = 160000000 / LCD_PERIPH_CLOCK_PRE_SCALE;
#if CONFIG_PM_ENABLE
            ret = esp_pm_lock_create(ESP_PM_APB_FREQ_MAX, 0, "rgb_panel", &panel->pm_lock);
            ESP_RETURN_ON_ERROR(ret, TAG, "create ESP_PM_APB_FREQ_MAX lock failed");
            // hold the lock during the whole lifecycle of RGB panel
            esp_pm_lock_acquire(panel->pm_lock);
            ESP_LOGD(TAG, "installed ESP_PM_APB_FREQ_MAX lock and hold the lock during the whole panel lifecycle");
#endif
            break;
        case USER_RGB_CLK_SRC_PLL240M:
            panel->src_clk_hz = 240000000 / LCD_PERIPH_CLOCK_PRE_SCALE;
            break;
        case USER_RGB_CLK_SRC_XTAL:
            panel->src_clk_hz = rtc_clk_xtal_freq_get() * 1000000;
            break;
        default:
            ESP_RETURN_ON_FALSE(false, ESP_ERR_NOT_SUPPORTED, TAG,  "unsupported clock source: %d", clk_src);
            break;
    }
    return ret;
}
#endif

#endif // SOC_LCD_RGB_SUPPORTED
